In [1]:
import pandas as pd 
df = pd.read_csv("student_record.CSV")
print(df)

          Name  Age      proffesion
0         yash   21    data science
1  yashvardhan   24  data analysist
2        suraj   23           ai/ml
3       taneya   21            12th

In [2]:
df.head()

          Name  Age      proffesion
0         yash   21    data science
1  yashvardhan   24  data analysist
2        suraj   23           ai/ml
3       taneya   21            12th

In [4]:
df.tail()

          Name  Age      proffesion
0         yash   21    data science
1  yashvardhan   24  data analysist
2        suraj   23           ai/ml
3       taneya   21            12th

In [3]:
df.columns

Index(['Name', 'Age', 'proffesion'], dtype='object')

In [6]:
df['Age']

0    21
1    24
2    23
3    21
Name: Age, dtype: int64

In [7]:
df[['Age','proffesion']]

   Age      proffesion
0   21    data science
1   24  data analysist
2   23           ai/ml
3   21            12th

In [8]:
df.describe()

         Age
count   4.00
mean   22.25
std     1.50
min    21.00
25%    21.00
50%    22.00
75%    23.25
max    24.00

In [10]:
df.describe(include='all')

        Name    Age    proffesion
count      4   4.00             4
unique     4    NaN             4
top     yash    NaN  data science
freq       1    NaN             1
mean     NaN  22.25           NaN
std      NaN   1.50           NaN
min      NaN  21.00           NaN
25%      NaN  21.00           NaN
50%      NaN  22.00           NaN
75%      NaN  23.25           NaN
max      NaN  24.00           NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Age         4 non-null      int64
 2   proffesion  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [11]:
df.shape

(4, 3)

In [12]:
df.size

12